## Dealing with Missing Data

In [2]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Droping Null  Values

In [5]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [7]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [8]:
# Dont drop rows that has two or more than 2 non null values 
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
# Determine if row or column is removed from DataFrame, 
# when we have at least one NA or all NA
df.dropna(how="all")

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Fill null values

In [10]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [12]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [13]:
df2 = {'A':[1,2,3],'B':[5,5,4],'C':[1,2,3]}
df2

{'A': [1, 2, 3], 'B': [5, 5, 4], 'C': [1, 2, 3]}

In [14]:
df.add(df2)

     A     B  C
0  2.0  10.0  2
1  4.0   NaN  4
2  NaN   NaN  6

In [24]:
fill = df["C"].mean()
df.add(df2, fill_value=1.0)

NotImplementedError: fill_value 1.0 not supported.